{
  "CS 110": {
    "course_name": "Computing in the Age of AI",
    "course_distribs": "MM",
    "course_core": false,
    "description": "This course aims to provide students with the knowledge and skills to become informed digital citizens in the age of AI, ready to navigate the digital landscape. Students will gain fundamental technical understanding of how computers, the Web, and AI work, and will study three programming languages: HTML5, CSS, and JavaScript. Students will also examine and discuss societal and ethical issues related to the Web and AI technologies, and consider responsible and future use of these technologies."
  },
  "CS 111": {
    "course_name": "Computer Programming and Problem Solving",
    "course_distribs": "MM",
    "course_core": true,
    "description": "An introduction to problem-solving through computer programming. Students learn how to read, modify, design, debug, and test algorithms that solve problems. Programming concepts include control structures, data structures, abstraction, recursion, and modularity. Students explore these concepts in the context of interactive programs, data processing, and graphics or audio, using the Python programming language."
  },
  "CS 112": {
    "course_name": "Intro Computing for the Sciences",
    "course_distribs": "MM",
    "course_core": true,
    "description": "An introduction to problem-solving through computer programming with special focus on application to problems relevant to physics, chemistry, and biology. Students learn how to read, modify, design, debug, and test algorithms that solve problems. Programming concepts include control structures, problem solving strategies, abstraction, recursion, and modularity. Students explore these concepts in the context of interactive programs, data processing, and graphical and numerical analysis, using the Python programming language. Students are required to attend a 2.5-hour lab where they will apply concepts learned in lecture to study topics at the intersection of chemistry and physics. Topics might include: chemical kinetics, numerical integration, molecular dynamics, computational biology, Monte Carlo techniques, and basic statistical analysis."
  },
  "CS 121": {
    "course_name": "Intro to Game Design",
    "course_distribs": "MM",
    "course_core": false,
    "description": "Video games are a popular form of interactive media that engage players in dynamic experiences through unprecedented combinations of storytelling, visualization, interactivity, and multi-sensory immersion. This course will introduce students to video game production and concepts. We will develop a framework for critically analyzing this medium, learn to identify effective strategies for creating games and describe what elements of design impact the final experience of a game. We'll also identify the function of user agency in this medium to better understand how players are affected by representation in video games. Throughout the course, students will be asked to apply these concepts while building their own games and become familiar with the fundamentals of video game design."
  },
  "CS 204": {
    "course_name": "Intro to Web Development",
    "course_distribs": "MM",
    "course_core": false,
    "description": "This course introduces modern web development using HTML, CSS, and JavaScript. JavaScript is explored in detail, including scoping, closures, objects, classes, object-oriented programming, and modules. The jQuery library is also introduced, and the course covers event handling and Ajax interactions. Students will build web pages that manage data structures using menus and forms, and that save/restore that data from local storage resulting in a persistent, dynamic web application. Designed web pages will be modern, responsive, and accessible. The course also covers Bootstrap and the jQuery UI (User Interface) library."
  },
  "CS 220": {
    "course_name": "Human-Computer Interaction",
    "course_distribs": "MM",
    "course_core": false,
    "description": "Human-Computer Interaction is one of the areas that have transformed the way we use computers in the last 30 years. Topics include methodology for designing and testing user interfaces, interaction styles (command line, menus, graphical user interfaces, virtual reality, tangible user interfaces), interaction techniques (including use of voice, gesture, eye movements), design guidelines, and user interface software tools. Students will design a user interface, program a prototype, and test the results for usability."
  },
  "CS 230": {
    "course_name": "Data Structures",
    "course_distribs": "MM",
    "course_core": true,
    "description": "An introduction to techniques and building blocks for organizing large programs. Topics include: modules, abstract data types, recursion, algorithmic efficiency, and the use and implementation of standard data structures and algorithms, such as lists, trees, graphs, stacks, queues, priority queues, tables, sorting, and searching. Students become familiar with these concepts through weekly programming assignments using the Java programming language."
  },
  "CS 231": {
    "course_name": "Fundamental Algorithms",
    "course_distribs": "MM",
    "course_core": true,
    "description": "This course introduces the design and analysis of fundamental algorithms. It focuses on the basic skills needed to design efficient, correct algorithms and mathematically prove these properties. General problem-solving techniques covered: divide-and-conquer, dynamic programming, greediness, and probabilistic algorithms. Topics include: sorting, searching, graph algorithms, optimization, network flows, asymptotic analysis, compression, and NP-completeness."
  },
  "CS 235": {
    "course_name": "Theory of Computation",
    "course_distribs": "MM",
    "course_core": true,
    "description": "This course offers an introduction to the theory of computation. Topics include languages, regular expressions, finite automata, grammars, pushdown automata, and Turing machines. The first part of the course covers the Chomsky hierarchy of languages and their associated computational models. The second part of the course focuses on decidability issues and unsolvable problems. The final part of the course investigates complexity theory."
  },
  "CS 240": {
    "course_name": "Foundations of Computer Systems",
    "course_distribs": "MM, LAB",
    "course_core": true,
    "description": "This course examines how computers run programs, introducing key software and hardware abstractions and implementations between programming languages and transistors. The course traces representation and translation of data and programs through three broad topics in computer systems: computer hardware implementation, including digital logic, computer arithmetic, and machine organization; the hardware-software interface, including instruction set architecture, assembly code, and the C programming language; and abstractions for practical systems, including the physical memory hierarchy, the operating system process model, virtual memory, and memory management. Students complete extensive hands-on projects in hardware and software systems. Students are required to attend one three-hour laboratory weekly."
  },
  "CS 242": {
    "course_name": "Computer Networks",
    "course_distribs": "MM",
    "course_core": false,
    "description": "A systems-oriented approach to data networks, including a theoretical discussion of common networking problems and an examination of modern networks and protocols. Topics include point-to-point links, packet switching, Internet protocols, end-to-end protocols, congestion control, and security. Projects may include client-server applications and network measurement tools."
  },
  "CS 245": {
    "course_name": "Probabilistic Foundations of Predictive ML",
    "course_distribs": "MM",
    "course_core": false,
    "description": "In recent years, Machine Learning (ML) has been used in novel applications—from generating new art and music to systems that accurately and reliably predict outcomes of medical interventions in real-time. Faster computing hardware, large datasets, and the probabilistic paradigm of ML, which frames advances like neural networks within statistical learning, have enabled these developments. In this course, we introduce the foundational concepts behind the probabilistic paradigm of predictive ML: statistical model specification and learning. We will focus on connecting theory with real-world applications. Students will get hands-on experience building models for specific tasks, most taken from healthcare contexts, using probabilistic programming languages. While expanding our methodological toolkit, we will simultaneously introduce critical perspectives to examine the ethics of ML within sociotechnical systems. This course lays the foundation for advanced study and research in ML. Topics include: directed graphical models, deep regression/classification, frequentist learning, and model evaluation."
  },
  "CS 304": {
    "course_name": "Databases with Web Interfaces",
    "course_distribs": "MM",
    "course_core": false,
    "description": "CS 304 is a course in full-stack web development. The stack comprises the front-end (typically a web browser), the back-end (a database for storing and retrieving user-contributed data) and the middleware that knits the two together. We will learn how to parse the incoming web request, route the request to the appropriate handler, retrieve data from the database that is relevant to the user's search, combine that data with static templates of web pages, and deliver that data to the browser. We will build endpoints to handle Ajax requests and learn about REST APIs.  We will also discuss performance, reliability,  concurrency, and security issues. In a semester project, we will create dynamic websites driven by database entries. In the fall, the CS 304 stack will comprise Flask and MySQL. In the spring, the CS 304 stack will comprise Node.js and MongoDB."
  },
  "CS 320": {
    "course_name": "Tangible User Interfaces",
    "course_distribs": "MM",
    "course_core": false,
    "description": "Tangible user interfaces emerge as a novel human-computer interaction style that interlinks the physical and digital worlds. Extending beyond the limitations of the computer mouse, keyboard, and monitor, tangible user interfaces allow users to take advantage of their natural spatial skills while supporting collaborative work. Students will be introduced to conceptual frameworks, the latest research, and a variety of techniques for designing and building these interfaces. Developing tangible interfaces requires creativity as well as an interdisciplinary perspective. Hence, students will work in teams to design, prototype, and physically build tangible user interfaces."
  },
  "CS 321": {
    "course_name": "Extended Reality",
    "course_distribs": "MM",
    "course_core": false,
    "description": "Mixed and Augmented Reality technologies combine virtual content with the physical environment, allowing people to interact with computers and digital content in exciting new ways. These emerging human-computer interaction paradigms have been applied to a variety of fields including medicine, education, design, entertainment, and play. This course introduces fundamental methods, principles, and tools for designing, programming, and testing mixed and augmented reality applications. Topics include the history of virtual and augmented reality, application domains, hardware for 3D input and display, tracking and registration, 3D perception, and societal implications. Students will work individually and in teams to develop novel virtual and augmented reality experiences."
  },
  "CS 342": {
    "course_name": "Computer Security",
    "course_distribs": "MM",
    "course_core": false,
    "description": "An introduction to computer security. Topics include the security mindset, authentication, access control, operating system security (with a focus on Linux), cryptography, security protocols, software security, network security, usable security, privacy, social engineering, and the ethics of hacking. This course will emphasize hands-on experience with technical topics and the ability to communicate security and privacy topics to lay and expert audiences. Assignments will include technical exercises exploring security exploits and tools in a Linux environment; problem sets including exercises and proofs related to theoretical aspects of computer security; and opportunities to research, write, present, and lead discussions on security-related topics."
  },
  "CS 343": {
    "course_name": "Distributed Computing",
    "course_distribs": "MM",
    "course_core": false,
    "description": "This course is for students interested in understanding the fundamental concepts and algorithms underlying existing distributed systems. By the end of this course, students will have the knowledge needed to work with and build distributed systems, such as distributed file systems, peer-to-peer systems, and cloud computing systems. Topics discussed include MapReduce, distributed file systems, distributed coordination algorithms, consensus, fault-tolerance, and security."
  },
  "CS 344": {
    "course_name": "Deep learning",
    "course_distribs": "MM",
    "course_core": false,
    "description": "Deep learning is the study of how computers can learn from data in a manner inspired by neural connections in the human brain. It is revolutionizing how people and machines interact. This course explores the principles and practice of modern deep learning systems. Students will design and implement their own artificial neural networks as well as analyze massive deep learning models at the forefront of the field of machine learning. Deep learning algorithms such as convolutional neural networks and recurrent neural networks will be applied in a variety of domains, including medical diagnosis, self-driving cars, and large-language models. Students will further investigate the societal impacts and ethical considerations of these deep learning systems."
  },
  "CS 365": {
    "course_name": "Advanced Projects in Playable Media",
    "course_distribs": "MM",
    "course_core": false,
    "description": "Students with a deep personal interest in digital game design and other forms of playable media will work in collaborative units to explore all aspects of the game development process while contributing to a semester-length project of their own devising. This course will require students to explore an ethical approach to game development that will introduce new practices for ideation, pitching, designing, playtesting, and versioning through an iterative process that will result in a finished game. This course is specifically designed for students who have moderate experience with game development through either curricular activities or by working on projects of their own. Students will be expected to have moderate levels of experience with the Unity Game Engine."
  }
}